Revit 2027 API
ParameterTypeId.FabricationPartDepthOut Property
 "Main Secondary Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartDepthOut { get; }
Public Shared ReadOnly Property FabricationPartDepthOut As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartDepthOut {
	ForgeTypeId^ get ();
}
static member FabricationPartDepthOut : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace